constant/transportProperties
// constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

phases (water air);

water
{
    transportModel  Newtonian;
    nu             1e-06;
    rho            998.2;
}

air
{
    transportModel  Newtonian;
    nu             1.48e-05;
    rho            1.225;
}

sigma           0.07;