system/setFieldsDict
// system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (5 0.15 0.409);  // Initial water height of 0.15m
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);